Author: Mohd Azam
Date: July, 2019

In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4,5,6],'col2':[444,555,666,444,666,444],'col3':['abc','def','ghi','xyz','abc','xyz']})
df.head(6)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   666  abc
5     6   444  xyz

In [4]:
# Get the Unique values in Coloum 'col2'
df['col2'].unique()

array([444, 555, 666])

In [5]:
# Get the number of unique value in 'col2'
df['col2'].nunique()

3

In [6]:
# Get the count of each value in 'col2'
df['col2'].value_counts()

444    3
666    2
555    1
Name: col2, dtype: int64

In [7]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz
5     6   444  xyz

#### Applying Functions on dataframe

In [8]:
def doubleValue(x):
    return x*2

In [9]:
df['col1'].apply(doubleValue)

0     2
1     4
2     6
3     8
4    10
5    12
Name: col1, dtype: int64

In [10]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
Name: col3, dtype: int64

In [11]:
df['col1'].sum()

21

In [12]:
# Parmanent remove the coloum

In [13]:
del df['col1']

In [14]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   666  abc
5   444  xyz

In [15]:
# Get the all coloum name in dataframe

df.columns

Index(['col2', 'col3'], dtype='object')

In [16]:
# Get the Index details 

df.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
# Sorting the dataframe by coloum

In [18]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   666  abc
5   444  xyz

In [19]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
5   444  xyz
1   555  def
2   666  ghi
4   666  abc

In [20]:
# Find Null values

In [21]:
# False mean value is present 
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False

In [22]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   666  abc
5   444  xyz

In [23]:
data = {'Product':['Bread','Bread','Bread','Drink','Drink','Drink'],
     'Gender':['Man','Man','Women','Women','Man','Man'],
       'Country':['US','UK','US','UK','US','UK'],
       'Qunatity':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

  Product Gender Country  Qunatity
0   Bread    Man      US         1
1   Bread    Man      UK         3
2   Bread  Women      US         2
3   Drink  Women      UK         5
4   Drink    Man      US         4
5   Drink    Man      UK         1

In [26]:
df.pivot_table(values='Qunatity',index=['Gender'],columns=['Country'])

Country   UK   US
Gender
Man      2.0  2.5
Women    5.0  2.0